[LANGUAGE]
language=0


[CHINESE]
GUANYU_JIESHAO=Driver para Teclado Gamer V1.0 (ES)
GUANYU_BANQUAN=Redragon Argentina (2017)
MACRO_CYCLES=Cycles
RECORD_DELAY=Record Delay




UNKNOWN_KEY=Tecla desconocida: %03x
MEDIA_PALYER_1=Reproductor de Media
MEDIA_PALY_PAUSE_2=Reproducir/Pausa
MEDIA_STOP_PALY_3=Stop
MEDIA_PREV_TRACK_4=Anterior
MEDIA_Next_TRACK_5=Siguiente
MEDIA_V_LOW_6=Volumen-
MEDIA_V_ADD_7=Volumen+
MEDIA_MUTE_8=Mute
MEDIA_WWW_HOME_9=Pagina de inicio
MEDIA_WWW_REFRESH_10=Actualizar
MEDIA_WWW_STOP_11=Stop
MEDIA_WWW_BACK_12=Retroceder página
MEDIA_WWW_FORWARD_13=Avanzar página
MEDIA_WWW_FAVORITE_14=Favoritos
MEDIA_WWW_SEARCH_15=Buscar
MEDIA_MY_PC_16=Mi PC
MEDIA_CALC_17=Calculadora
MEDIA_MAIL_18=E-mail


COMPOSITE_PROMPT_CLEAR =Reestablecer la función de los botones
COMPOSITE_PROMPT_OSK =Abrir teclado en pantalla
COMPOSITE_PROMPT_DEMO =El programa se está usando en versión Demo, no puede usar más de 2 macros
COMPOSITE_MACRO_OVER =El tamaño de la macro excede el permitido


APPLY_PROMPT=No se puede editar en el modo default
MACRO_DELETE_CONFIRM_OF_KEYS=Desea borrar esta Macro?
KEY_PROMPT=Usted está editando botones de macro, no es posible cambiar la iluminación
KEY_PROMPT_SET=Configurar tecla como:
KEY_PROMPT_SINGLE=Tecla(
KEY_PROMPT_MACRO=Macro(
KEY_PROMPT_MEDIA=Media(
KEY_PROMPT_FUNCTION=Función(


MACRO_ACTION_RECORD_DELAY=Delay de Grabación
MACRO_NEW_PREFIX =Macro
MACRO_ERR_MAX =Número máximo de macros: %d
MACRO_ERR_SAME =Nombre de macro ya utilizado
MACRO_ERR_NAME_SYSTEM =La macro ya está en uso
MACRO_DEFAULT_NAME =Macro vacia
MACRO_ERR_RECORD =Parar la grabación de la macro
MACRO_PROMPT_DEMO =Usted usa la versión demo, no puede usar más de 20 macros!
MACRO_KEYS_TISHI=Keys
MACRO_ACTION_TISHI=Action
MACRO_DELAY_MS= Latency (ms)

MACRO_ACTION_CLEAR_CONFIRM =Realmente desea borrar el contenido de la macro?
MACRO_ACTION_ERR_MODIFY =La edición no es posible, utilice una macro para registrar las acciones
MACRO_ACTION_ERR_DELAY_MIN = Latencia mínima: %d(ms)
MACRO_ACTION_ERR_DELAY_MAX = Latencia máxima: %d(ms)
MACRO_ACTION_RECORD =Record
MACRO_ACTION_STOP_RECORD = Stop 
MACRO_ACTION_ERR_KEYS_PROMPT =Los siguientes botones no pueden ser liberados durante la reproducción de una macro
MACRO_ACTION_ERR_KEYS_PROMPT2 = \r\n ¿Desea Continuar?
EXTRA_MACRO_TOO_LONG = Tamaño de macro supera lo permitido.\r\n Reducir el número de macros o acciones.

DEFAULT_PROFILE_NAME =<Perfil por defecto>
PROFILE_SELECT_PROMPT =Guardar configuración de este modo?
PROFILE_SEELCT_PROMPT2 =Cerrar el dialogo para modo rápido
PROFILE_SELECT_PROMPT3 = Desea descartar los cambios y cambiar el modo?
PROFILE_LOAD_PROMPT =Cambiar el modo va a parar automáticamente la reproducción de la macro!
PROFILE_CHECK_PROMPT = Archivo de configuración no existe, cargue la configuración por defecto
PROFILE_FORMAT_ERROR = formato de archivo incorrecto, cambiar a valores por defecto: \n  %s
PROFILE_NEW = Nuevo perfil
PROFILE_TIP = Perfil actual: 
PROFILE_EDITING = Durante la edición no es posible cambiar el modo.
EXTRA_PROFILE_SPACE_TIGHT =  No hay suficiente espacio para almacenar la macro

MAIN_UPDATE_ERROR_TEXT=Seleccione el archivo de actualización correcto
MAIN_BOOT_ERROR_TEXT=Error al entrar al modo de inicialización
MAIN_SHELL_ERROR_TEXT=Error al realizar update de archivo
MAIN_UPDATE_BACKUP_OK=Backup realizado con éxito!
MAIN_UPDATE_BACKUP_NG=Falla al realizar backup. Intente nuevamente!

KEYBOARD_TRAY_DESC = Redragon Keyboard Software
MAIN_CAPTION = Redragon Keyboard Configuration
MAIN_HELP_PROMPT = Ayuda
MAIN_MINIMIZE_PROMPT = Minimizar
MAIN_MENU_PROMPT = Menú
MAIN_CLOSE_PROMPT = Cerrar
MAIN_BUTTON_DEARMO_VER = Versión de Driver V1.0 (AR)
MAIN_PROMPT_DEFAULT = Desea reestablecer las configuraciones por defecto?
MAIN_PROMPT_INPORT =Error en el formato de archivo: falla en la importación. 
MAIN_PROMPT_DRIVER_TEXT =Detectamos que el driver de este teclado no está instalado. \r\nPresione [OK] para iniciar a instalación del Driver!
MAIN_PROMPT_DRIVER_TITLE = Driver del Teclado
MAIN_SWITCH_FUNCTION_TEXT = Cambie el modo de iluminación del dispositivo
MAIN_SWITCH_COLOR_TEXT = Cambie la función de las teclas
MAIN_DEFAULT_MATRIX_PROMPT = Falla al leer el Layout por defecto del Teclado
MAIN_NO_DEVICE_PROMPT = Dispositivo compatible no conectado，verifique la conexión e intente nuevamente

MENU_1=Import
MENU_2=Export
MENU_3=About..
MENU_4=Quit


MENU_11=Open(&A)
MENU_22=About..(&S)
MENU_33=Close(&X)



CHINESE_5=Chino
ENGINSH_6=Portugues

SINGLE_STATIC=Press a key...
MACRO_NAME_SETTING=Macro Name
KEY_SETTING_TISHI=Key Configuration
MACRO_EDIT_TISHI=Macro Editor

MEDIA_EDIT_TISHI=Seleccionar Media
FUNCTION_TISHI=Configuración de la tecla de Función

;PROFILE_1 =情景模式1
;PROFILE_2 = 情景模式2
;PROFILE_3 = 情景模式3
;PROFILE_MACRO = 宏编辑
;PROFILE_DEFAULT=恢复默认设置
;PROFILE_OK=确定
;PROFILE_CANCLE = 取消
;PROFILE_APPLY = 应用


SINGLE_KEY=Tecla
MACRO_SETTING=Macro Configuration
MULTI_MEDIA=Multimedia
FUNCTION_KEY=Tecla de Función
A_TOP=Top
A_UP=Up
A_DOWN=Down
A_BOTTOM=Bottom
A_RECORD=Record
A_DELETE=Delete
A_CLEAR=Clear
MACRO_OK=Ok
MACRO_CANCLE=Cancel

FUNC_KEY_DESC1=Abrir
FUNC_KEY_DESC2=Nuevo
FUNC_KEY_DESC3=Deshacer
FUNC_KEY_DESC4=Guardar
FUNC_KEY_DESC5=Copiar
FUNC_KEY_DESC6=Cortar
FUNC_KEY_DESC7=Pegar
FUNC_KEY_DESC8=Buscar
FUNC_KEY_DESC9=Seleccionar todo
FUNC_KEY_DESC10=Zoom-
FUNC_KEY_DESC11=Zoom+


[CHINESE]
GUANYU_JIESHAO=Gamming Keyboard Driver V1.0
GUANYU_BANQUAN=Copyright (C) 2016

SINGLE_STATIC=Please input a single key
MACRO_NAME_SETTING=Macro Name
KEY_SETTING_TISHI=Key Setting
MACRO_EDIT_TISHI=Macro Setting
MEDIA_EDIT_TISHI=Select a Media
FUNCTION_TISHI=Function Key Setting
PROFILE_1=Profile1
PROFILE_2=Profile2
PROFILE_3=Profile3
PROFILE_MACRO=Macro
PROFILE_DEFAULT=Restore Default
PROFILE_OK=OK
PROFILE_CANCLE=Cancel
PROFILE_APPLY=Apply
MACRO_CYCLES=Cycles
RECORD_DELAY=Record Delay
SINGLE_KEY=Single key
MACRO_SETTING=Macro setting
MULTI_MEDIA=Multimedia
FUNCTION_KEY=Function key
A_TOP=Uptop
A_UP=Up
A_DOWN=Down
A_BOTTOM=Bottom
A_RECORD=Record
A_DELETE=Delete
A_CLEAR=Clear	
MACRO_OK=OK
MACRO_CANCLE=Cancel
UNKNOWN_KEY=Unknown Key: %03x
MEDIA_PALYER_1=Media Player
MEDIA_PALY_PAUSE_2=Play/Pause
MEDIA_STOP_PALY_3=Stop Play
MEDIA_PREV_TRACK_4=Prev Track
MEDIA_Next_TRACK_5=Next Track
MEDIA_V_LOW_6=V-
MEDIA_V_ADD_7=V+
MEDIA_MUTE_8=Mute
MEDIA_WWW_HOME_9=WWW Home
MEDIA_WWW_REFRESH_10=WWW Refresh
MEDIA_WWW_STOP_11=WWW Stop
MEDIA_WWW_BACK_12=WWW Back
MEDIA_WWW_FORWARD_13=WWW Forward
MEDIA_WWW_FAVORITE_14=WWW Favorite
MEDIA_WWW_SEARCH_15=WWW Search
MEDIA_MY_PC_16=My PC
MEDIA_CALC_17=Calc
MEDIA_MAIL_18=Mail
COMPOSITE_PROMPT_CLEAR =Restore the default functiong of buttons
COMPOSITE_PROMPT_OSK =Open the on-screen keyboard
COMPOSITE_PROMPT_DEMO =Currently used is the DEMO program version
COMPOSITE_MACRO_OVER =Macro space beyond hardware store size
FUNC_KEY_DESC1=Open
FUNC_KEY_DESC2=New
FUNC_KEY_DESC3=Undo
FUNC_KEY_DESC4=Save
FUNC_KEY_DESC5=Copy
FUNC_KEY_DESC6=Cut
FUNC_KEY_DESC7=Paste
FUNC_KEY_DESC8=Find
FUNC_KEY_DESC9=Select All
FUNC_KEY_DESC10=Zoom-
FUNC_KEY_DESC11=Zoom+
APPLY_PROMPT=No Use!
MACRO_DELETE_CONFIRM_OF_KEYS=Detect some key points to set this macro, \n  really need to remove this macro?
KEY_PROMPT=No Use!
KEY_PROMPT_SET=Keys, Set:
KEY_PROMPT_SINGLE=Key(
KEY_PROMPT_MACRO=Macro(
KEY_PROMPT_MEDIA=Media(
KEY_PROMPT_FUNCTION=Function(
MACRO_ACTION_RECORD_DELAY=RecordDelay
MACRO_NEW_PREFIX =Macro
MACRO_ERR_MAX =The maximum number of macro: %d
MACRO_ERR_SAME =Same macro name!
MACRO_ERR_NAME_SYSTEM =This macro is used in the system!
MACRO_DEFAULT_NAME =Empty Macro
MACRO_ERR_RECORD =Please stop the macro record first!
MACRO_PROMPT_DEMO =Currently using a DEMO version of the program, can only play 20 times the maximum macro!
MACRO_KEYS_TISHI=Keys
MACRO_ACTION_TISHI=Action
MACRO_DELAY_MS=Delay(ms)
MACRO_ACTION_CLEAR_CONFIRM =Really need to clear the macro action?
MACRO_ACTION_ERR_MODIFY =You can not edit, use the macro record button.
MACRO_ACTION_ERR_DELAY_MIN = Minimum delay time is: %d(ms)
MACRO_ACTION_ERR_DELAY_MAX = Maximum delay time is: %d(ms)
MACRO_ACTION_RECORD =Record
MACRO_ACTION_STOP_RECORD = Stop Record
MACRO_ACTION_ERR_KEYS_PROMPT =When playing this macro is detected，the presence of the following was not eject buttons:
MACRO_ACTION_ERR_KEYS_PROMPT2 =\r\n  The need to continue? 
EXTRA_MACRO_TOO_LONG = Macro space exceeds the hardware space.\r\n Please reduce the number of macros or macro action number，and then download.
DEFAULT_PROFILE_NAME =<Default Profile>
PROFILE_SELECT_PROMPT =Whether to save the profile settings made?
PROFILE_SEELCT_PROMPT2 =When fast switch scene mode, you must first close the editor dialog box.
PROFILE_SELECT_PROMPT3 = Scene mode are editing, whether to give up the modification and change its mode?
PROFILE_LOAD_PROMPT = Switch scene mode will automatically stop the macro play!
PROFILE_CHECK_PROMPT = Scene mode file does not exist, load the default Settings!
PROFILE_FORMAT_ERROR = wrong file format, revert to the default values: \n  %s
PROFILE_NEW = \\The new contextual  mode
PROFILE_TIP = The current contextual  mode:
PROFILE_EDITING = You are editing, set not applications, can't change its mode
EXTRA_PROFILE_SPACE_TIGHT = shortage of hardware space, cancelled the macro name of storage.
MAIN_UPDATE_ERROR_TEXT=Please select the correct update file!
MAIN_BOOT_ERROR_TEXT=Unable to enter the Boot mode!
MAIN_SHELL_ERROR_TEXT=Unable to perform updating file!
MAIN_UPDATE_BACKUP_OK=备份成功!en
MAIN_UPDATE_BACKUP_NG=备份失败,请重新备份!en
KEYBOARD_TRAY_DESC = keyboard Driver
MAIN_CAPTION = Gaming Keyboard Settings
MAIN_HELP_PROMPT = Help
MAIN_MINIMIZE_PROMPT = Minimize
MAIN_MENU_PROMPT = Menu
MAIN_CLOSE_PROMPT = Close
MAIN_BUTTON_DEARMO_VER =
MAIN_PROMPT_DEFAULT = Do you want to restore the default settings?
MAIN_PROMPT_INPORT = File format error, import failed! 
MAIN_PROMPT_DRIVER_TEXT = Detects that the driver is not installed keyboard, \r\npress [OK] to start the driver installation!
MAIN_PROMPT_DRIVER_TITLE = Keyboard Driver
MAIN_SWITCH_FUNCTION_TEXT = Switch to the color keys mode
MAIN_SWITCH_COLOR_TEXT = Switch to the function keys mode
MAIN_DEFAULT_MATRIX_PROMPT = Reads the default keyboard layout failure
MAIN_NO_DEVICE_PROMPT = Device is not detected，the key settings can not be displayed!

MENU_1=Import
MENU_2=Export
MENU_3=About
MENU_4=Close
CHINESE_5=Chinese
ENGINSH_6=English

MENU_11=Open(&O)
MENU_22=About(&A)
MENU_33=Exit(&X)

